[
  {
  "file": "Searching_algos.html",
  "title": "Exploring Search Algorithms — From Linear to Binary 🚀",
  "summary": "Learn the fundamentals of Linear and Binary Search algorithms, their implementation in Python, and when to use each. Includes step-by-step code and comparison.",
  "date": "June 26, 2025"
  },
  {
  "file": "Wiki_Hindi_scrapper.html",
  "title": "Deep Dive: Functions in Our Hindi Wikipedia Scraper 🕸️",
  "summary": "Have you ever wondered how to automatically retrieve and clean Hindi text from Wikipedia? This post walks through the requests and BeautifulSoup modules and explains each function in a reusable scraper class, ending with the full ready-to-run code.",
  "date": "May 20, 2025"
  },
  {
  "file": "Blog_Generation_Agent.html",
  "title": "LangGraph Agent to HTML Blog Generator — Building Blogs with AI ✍️🤖",
  "summary": "Learn how to generate HTML blog posts from Jupyter notebooks using LangChain, LangGraph, and Ollama. This post walks through loading, retrieving, reasoning, and generating structured blog content with a full pipeline.",
  "date": "May 18, 2025"
  },
  {
  "file": "LangChain_Document_Loaders.html",
  "title": "LangChain Document Loaders — A Unified Gateway to Your Data 📄🔗",
  "summary": "Explore how to use LangChain's powerful document loaders to bring in data from PDFs, websites, YouTube, CSVs, Notion, and even structured JSON — all with just a few lines of code.",
  "date": "May 11, 2025"
  },
  {
  "file": "RAG_with_LangGraphs.html",
  "title": "Graph-Powered RAG with LangChain, Chroma DB, and Gemma 3",
  "summary": "Build an advanced Retrieval-Augmented Generation (RAG) pipeline using LangGraph and Gemma 3 model — all explained with detailed code and visualization.",
  "date": "May 10, 2025"
  },
  {  
    "file": "Building_a_RAG_Pipeline_with_PDFs.html",
    "title": "Building a RAG Pipeline with PDFs, Chroma DB, and Gemma 3",
    "summary": "Step-by-step guide to building a Retrieval-Augmented Generation pipeline using LangChain, HuggingFace embeddings, and your own PDF (resume) as a knowledge base.",
    "date": "May 9, 2025"
  },
  {
    "file": "Langchains_with_Ollama.html",
    "title": "LangChain + Ollama: Your Gateway to LLM Apps, Explained with Code 💡",
    "summary": "This blog walks through how to build with LangChain and Ollama — covering chat vs. completion models, prompt templates, and hands-on code to get started fast.",
    "date": "May 8, 2025"
  },
  {
    "file": "Setting_up_Ollama.html",
    "title": "Setting Up Ollama 🦙",
    "summary": "Get started with Ollama — a no-token, local-friendly way to run LLMs on your machine. Setup steps and essential commands included.",
    "date": "May 7, 2025"
  },
  {
    "file": "Lasso_Regression_from_Scratch.html",
    "title": "Lasso Regression from Scratch — Feature Selection Meets Regularization",
    "summary": "Learn how to implement Lasso Regression using Coordinate Descent from scratch, and explore how L1 regularization leads to feature selection in high-dimensional data.",
    "date": "May 6, 2025"
  },
  {
    "file": "Ridge_Regression_from_Scratch.html",
    "title": "Ridge Regression from Scratch — With Gradient Descent and L2 Regularization",
    "summary": "Explore how to implement Ridge Regression using gradient descent from scratch. Learn why regularization matters and compare performance against OLS and SGD models.",
    "date": "May 3, 2025"
  },
  {
    "file": "Decision_Tree_Regression_from_Scratch.html",
    "title": "Decision Tree Regressor from Scratch — Split, Predict, Repeat",
    "summary": "Explore how decision trees make predictions by learning to split data based on error reduction. This guide walks through a full tree regressor implementation in Python.",
    "date": "April 28, 2025"
  },
  {
    "file": "Linear_Regression_from_Scratch.html",
    "title": "Linear Regression from Scratch — With Gradient Descent",
    "summary": "This blog breaks down gradient descent like never before and walks you through building your own predictive model from scratch. Simple, sharp, and hands-on.",
    "date": "April 23, 2025"
  },
  {
    "file": "Linear_Regression_OLS.html",
    "title": "Mastering Linear Regression with OLS: A Hands-On Guide Using California Housing Data",
    "summary": "Dive deep into Ordinary Least Squares (OLS) linear regression with a real-world dataset. This blog walks you through each step — from loading data to evaluating model performance.",
    "date": "April 19, 2025"
  },
  {
    "file": "Python_Setup.html",
    "title": "Setting Up Your Python Environment 🐍",
    "summary": "A beginner-friendly guide to creating and managing Python virtual environments, installing packages, and using pip effectively.",
    "date": "April 14, 2025"
  },
  {
    "file": "Hello_World.html",
    "title": "Hello World! 🚀 — My First Blog Post",
    "summary": "Kicking off my blog with excitement and a glimpse of what’s to come. Let the journey begin!",
    "date": "April 14, 2025"
  }
]
